Revit 2027 API
DistributionSysTypeSet.Erase Method
Removes a specified DistributionSys type from the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	DistributionSysType item
)
Public Overridable Function Erase (
	item As DistributionSysType
) As Integer
public:
virtual int Erase(
	DistributionSysType^ item
)
abstract Erase :
        item : DistributionSysType -> int
override Erase :
        item : DistributionSysType -> int
Parameters
item DistributionSysType
The DistributionSys type to be erased.
Return Value
Int32
The number of DistributionSys types that were erased from the set.
See Also
Reference
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace